servidor/app/controllers/beers_controller.rb

SELECT `beers`.* FROM `beers`
---
  def index
    @beers = Beer.all

INSERT INTO `beers` (`created_at`, `description`, `name`, `updated_at`) VALUES ('2014-11-11 22:59:37', 'mamaallala\r\n', 'escupo', '2014-11-11 22:59:37')
---
  def create
    @beer = Beer.new(beer_params)

    respond_to do |format|
      if @beer.save

UPDATE `beers` SET `description` = '', `name` = '', `updated_at` = '2014-11-17 00:50:32' WHERE `beers`.`id` = 3
---
  def update
    respond_to do |format|
      if @beer.update(beer_params)

DELETE FROM `beers` WHERE `beers`.`id` = 1
---
  def destroy
    @beer.destroy

SELECT  `beers`.* FROM `beers`  WHERE `beers`.`id` = 1 LIMIT 1
---
    def set_beer
      @beer = Beer.find(params[:id])